#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Tyk/repo-policy-tyk-identity-broker/runs/run-2kprEo5HYGsBVZdA

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
module.tyk-identity-broker.github_repository.repository: Refreshing state... [id=tyk-identity-broker]
module.tyk-identity-broker.github_branch.default: Refreshing state... [id=tyk-identity-broker:master]
module.tyk-identity-broker.github_branch.release_branches["release-1.4"]: Refreshing state... [id=tyk-identity-broker:release-1.4]
module.tyk-identity-broker.github_branch.release_branches["release-1.3"]: Refreshing state... [id=tyk-identity-broker:release-1.3]
module.tyk-identity-broker.github_branch.release_branches["release-1.2"]: Refreshing state... [id=tyk-identity-broker:release-1.2]
module.tyk-identity-broker.github_branch.release_branches["master"]: Refreshing state... [id=tyk-identity-broker:master]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.3"]: Refreshing state... [id=BPR_kwDOAtnrYs4B_GQn]
module.tyk-identity-broker.github_branch_protection.automerge["master"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTUzMTE5Nzc=]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.4"]: Refreshing state... [id=BPR_kwDOAtnrYs4CHTEd]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.2"]: Refreshing state... [id=BPR_kwDOAtnrYs4B_GQp]
module.tyk-identity-broker.github_branch_default.default: Refreshing state... [id=tyk-identity-broker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.tyk-identity-broker.github_branch.release_branches["release-1.4"] must be replaced
-/+ resource "github_branch" "release_branches" {
      ~ etag          = "W/\"0c0a2f74fd91717711e58ae251f764302f132c2a3eba4860c47bed21b766dbc2\"" -> (known after apply)
      ~ id            = "tyk-identity-broker:release-1.4" -> (known after apply)
      ~ ref           = "refs/heads/release-1.4" -> (known after apply)
      ~ sha           = "9ae43970227c4c0c11088ba7f3288e74cbc0b22b" -> (known after apply)
      ~ source_branch = "master" -> "main" # forces replacement
      ~ source_sha    = "9ae43970227c4c0c11088ba7f3288e74cbc0b22b" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @ermirizio, Action: `pull_request`*